; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v4)
             (pred_4 ?v1 ?v8)
             (pred_11 ?v6 ?v8)
             (pred_8 ?v3 ?v6 )
	     (pred_10 ?v6)
             (pred_2 ?v5)
             (pred_7 ?v1)
             (pred_12 ?v8)
             (pred_3 ?v6)
             (pred_1 ?v1)
             (pred_5 ?v6)
             (pred_6 ))



(:action op_5
:parameters (?v12 ?v9 ?v13 ?v7)
:precondition (and (pred_2 ?v12) (pred_2 ?v9) (pred_7 ?v13) (pred_12 ?v7)
          (pred_9 ?v12 ?v9) (pred_4 ?v13 ?v7)
                   (pred_11 ?v9 ?v7) (pred_10 ?v12) 
                   (pred_3 ?v9) (pred_1 ?v13))
:effect (and  (pred_5 ?v9) (not (pred_3 ?v9))))


(:action op_3
:parameters (?v12 ?v10)
:precondition (and (pred_2 ?v12) (pred_2 ?v10)
               (pred_10 ?v12) (pred_9 ?v12 ?v10) (pred_5 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v12))))

(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_2 ?v12) (pred_7 ?v13) 
                  (pred_10 ?v12) (pred_8 ?v13 ?v12) (pred_6 ))
:effect (and (pred_1 ?v13)
   (not (pred_8 ?v13 ?v12)) (not (pred_6 ))))


(:action op_2
:parameters (?v12 ?v2 ?v11)
:precondition (and (pred_2 ?v12) (pred_7 ?v2) (pred_7 ?v11)
                  (pred_10 ?v12) (pred_1 ?v11) (pred_8 ?v2 ?v12))
:effect (and (pred_1 ?v2) (pred_8 ?v11 ?v12)
        (not (pred_1 ?v11)) (not (pred_8 ?v2 ?v12))))

(:action op_4
:parameters (?v12 ?v13)
:precondition (and (pred_2 ?v12) (pred_7 ?v13) 
                  (pred_10 ?v12) (pred_1 ?v13))
:effect (and (pred_6 ) (pred_8 ?v13 ?v12) (not (pred_1 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_03 obj_29 obj_01 obj_22 obj_18 obj_06 obj_08 obj_04 obj_25 obj_31 obj_14 obj_28 obj_02 obj_11 obj_15 obj_27 obj_19 obj_16 obj_30 obj_17 obj_10 obj_20 obj_09 obj_12
    obj_13 obj_26 obj_21
    obj_24 obj_07 obj_05
    )

    (:init
       (pred_6)

       (pred_2 obj_23)
       (pred_2 obj_03)
       (pred_2 obj_29)
       (pred_2 obj_01)
       (pred_2 obj_22)
       (pred_2 obj_18)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_25)
       (pred_2 obj_31)
       (pred_2 obj_14)
       (pred_2 obj_28)
       (pred_2 obj_02)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_27)
       (pred_2 obj_19)
       (pred_2 obj_16)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_21)
       (pred_7 obj_24)
       (pred_7 obj_07)
       (pred_7 obj_05)

       (pred_9 obj_23 obj_18)
       (pred_9 obj_23 obj_03)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_29)
       (pred_9 obj_03 obj_23)
       (pred_9 obj_29 obj_08)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_29 obj_03)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_22)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_01)
       (pred_9 obj_18 obj_31)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_08 obj_28)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_29)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_25 obj_11)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_31 obj_15)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_31 obj_18)
       (pred_9 obj_14 obj_27)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_28 obj_19)
       (pred_9 obj_28 obj_02)
       (pred_9 obj_28 obj_08)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_28)
       (pred_9 obj_11 obj_30)
       (pred_9 obj_11 obj_25)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_31)
       (pred_9 obj_27 obj_10)
       (pred_9 obj_27 obj_19)
       (pred_9 obj_27 obj_14)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_28)
       (pred_9 obj_19 obj_27)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_30 obj_12)
       (pred_9 obj_30 obj_11)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_10 obj_27)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_20 obj_09)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_12 obj_30)
       (pred_9 obj_12 obj_09)
       (pred_3 obj_28)
       (pred_3 obj_30)
       (pred_3 obj_25)
       (pred_11  obj_28 obj_13)
       (pred_11  obj_30 obj_26)
       (pred_11  obj_25 obj_21)
       (pred_5 obj_23)
       (pred_5 obj_03)
       (pred_5 obj_29)
       (pred_5 obj_01)
       (pred_5 obj_22)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_31)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_15)
       (pred_5 obj_27)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_20)
       (pred_5 obj_09)
       (pred_5 obj_12)

       (pred_4  obj_24 obj_13)
       (pred_4  obj_07 obj_26)
       (pred_4  obj_05 obj_21)
       (pred_8 obj_24 obj_15)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_05 obj_17)
       (pred_10 obj_29)
    )

    (:goal (and
       (pred_8 obj_05 obj_08)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_3 obj_29 obj_03)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_03)
   goals met: 0 of 1
2. (op_3 obj_03 obj_23)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_23)
   goals met: 0 of 1
3. (op_3 obj_23 obj_18)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_18)
   goals met: 0 of 1
4. (op_3 obj_18 obj_31)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_31)
   goals met: 0 of 1
5. (op_3 obj_31 obj_15)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_15)
   goals met: 0 of 1
6. (op_3 obj_15 obj_17)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_05)
   deleted: (pred_8 obj_05 obj_17) (pred_6)
   added: (pred_1 obj_05)
   goals met: 0 of 1
8. (op_3 obj_17 obj_15)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_15)
   goals met: 0 of 1
9. (op_3 obj_15 obj_31)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_31)
   goals met: 0 of 1
10. (op_3 obj_31 obj_18)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_18)
   goals met: 0 of 1
11. (op_3 obj_18 obj_23)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_23)
   goals met: 0 of 1
12. (op_3 obj_23 obj_03)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_03)
   goals met: 0 of 1
13. (op_3 obj_03 obj_29)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_29)
   goals met: 0 of 1
14. (op_3 obj_29 obj_08)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_08)
   goals met: 0 of 1
15. (op_4 obj_08 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_6) (pred_8 obj_05 obj_08)
   goals met: 1 of 1
